app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def load_students
    movie = student_params[:movie]
    @students = if movie.present?
        Student.where student_table[:favoritemovie].matches("%#{movie}%")